; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-25)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 ball23 ball24 ball25 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(ball ball18)
(ball ball19)
(ball ball20)
(ball ball21)
(ball ball22)
(ball ball23)
(ball ball24)
(ball ball25)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 roomb)
(at ball6 roomb)
(at ball7 roomb)
(at ball8 roomb)
(at ball9 roomb)
(at ball10 roomb)
(at ball11 roomb)
(at ball12 roomb)
(at ball13 roomb)
(at ball14 room3)
(at ball15 room3)
(at ball16 room3)
(at ball17 room3)
(at ball18 room3)
(at ball19 room3)
(at ball20 room3)
(at ball21 room3)
(at ball22 room4)
(at ball23 room4)
(at ball24 room4)
(at ball25 room4)
(at-robby rooma)
)
(:goal
(and
(at ball1 room3)
(at ball2 room3)
(at ball3 room3)
(at ball4 room3)
(at ball5 room3)
(at ball6 room3)
(at ball7 room3)
(at ball8 room3)
(at ball9 room3)
(at ball10 room3)
(at ball11 room3)
(at ball12 room3)
(at ball13 room3)
(at ball14 room3)
(at ball15 room3)
(at ball16 room3)
(at ball17 room3)
(at ball18 room3)
(at ball19 room3)
(at ball20 room3)
(at ball21 room3)
(at ball22 room3)
(at ball23 room3)
(at ball24 room3)
(at ball25 room3)
)
)
)

; plan
1. (pick ball4 rooma left)
   deleted: (at ball4 rooma) (free left)
   added: (carry ball4 left)
   goals met: 8 of 25
2. (pick ball3 rooma right)
   deleted: (at ball3 rooma) (free right)
   added: (carry ball3 right)
   goals met: 8 of 25
3. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 8 of 25
4. (drop ball3 room3 right)
   deleted: (carry ball3 right)
   added: (at ball3 room3) (free right)
   goals met: 9 of 25
5. (drop ball4 room3 left)
   deleted: (carry ball4 left)
   added: (at ball4 room3) (free left)
   goals met: 10 of 25
6. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 10 of 25
7. (pick ball9 roomb left)
   deleted: (at ball9 roomb) (free left)
   added: (carry ball9 left)
   goals met: 10 of 25
8. (pick ball8 roomb right)
   deleted: (at ball8 roomb) (free right)
   added: (carry ball8 right)
   goals met: 10 of 25
9. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 10 of 25
10. (drop ball8 room3 right)
   deleted: (carry ball8 right)
   added: (at ball8 room3) (free right)
   goals met: 11 of 25
11. (drop ball9 room3 left)
   deleted: (carry ball9 left)
   added: (at ball9 room3) (free left)
   goals met: 12 of 25
12. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 12 of 25
13. (pick ball7 roomb left)
   deleted: (at ball7 roomb) (free left)
   added: (carry ball7 left)
   goals met: 12 of 25
14. (pick ball6 roomb right)
   deleted: (at ball6 roomb) (free right)
   added: (carry ball6 right)
   goals met: 12 of 25
15. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 12 of 25
16. (drop ball6 room3 right)
   deleted: (carry ball6 right)
   added: (at ball6 room3) (free right)
   goals met: 13 of 25
17. (drop ball7 room3 left)
   deleted: (carry ball7 left)
   added: (at ball7 room3) (free left)
   goals met: 14 of 25
18. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 14 of 25
19. (pick ball5 roomb left)
   deleted: (at ball5 roomb) (free left)
   added: (carry ball5 left)
   goals met: 14 of 25
20. (pick ball13 roomb right)
   deleted: (at ball13 roomb) (free right)
   added: (carry ball13 right)
   goals met: 14 of 25
21. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 14 of 25
22. (drop ball13 room3 right)
   deleted: (carry ball13 right)
   added: (at ball13 room3) (free right)
   goals met: 15 of 25
23. (drop ball5 room3 left)
   deleted: (carry ball5 left)
   added: (at ball5 room3) (free left)
   goals met: 16 of 25
24. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 16 of 25
25. (pick ball12 roomb left)
   deleted: (at ball12 roomb) (free left)
   added: (carry ball12 left)
   goals met: 16 of 25
26. (pick ball11 roomb right)
   deleted: (at ball11 roomb) (free right)
   added: (carry ball11 right)
   goals met: 16 of 25
27. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 16 of 25
28. (drop ball11 room3 right)
   deleted: (carry ball11 right)
   added: (at ball11 room3) (free right)
   goals met: 17 of 25
29. (drop ball12 room3 left)
   deleted: (carry ball12 left)
   added: (at ball12 room3) (free left)
   goals met: 18 of 25
30. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 18 of 25
31. (pick ball10 roomb left)
   deleted: (at ball10 roomb) (free left)
   added: (carry ball10 left)
   goals met: 18 of 25
32. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 18 of 25
33. (pick ball25 room4 right)
   deleted: (at ball25 room4) (free right)
   added: (carry ball25 right)
   goals met: 18 of 25
34. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 18 of 25
35. (drop ball25 room3 right)
   deleted: (carry ball25 right)
   added: (at ball25 room3) (free right)
   goals met: 19 of 25
36. (drop ball10 room3 left)
   deleted: (carry ball10 left)
   added: (at ball10 room3) (free left)
   goals met: 20 of 25
37. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 20 of 25
38. (pick ball24 room4 left)
   deleted: (at ball24 room4) (free left)
   added: (carry ball24 left)
   goals met: 20 of 25
39. (pick ball23 room4 right)
   deleted: (at ball23 room4) (free right)
   added: (carry ball23 right)
   goals met: 20 of 25
40. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 20 of 25
41. (drop ball23 room3 right)
   deleted: (carry ball23 right)
   added: (at ball23 room3) (free right)
   goals met: 21 of 25
42. (drop ball24 room3 left)
   deleted: (carry ball24 left)
   added: (at ball24 room3) (free left)
   goals met: 22 of 25
43. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 22 of 25
44. (pick ball22 room4 left)
   deleted: (at ball22 room4) (free left)
   added: (carry ball22 left)
   goals met: 22 of 25
45. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 22 of 25
46. (drop ball22 room3 left)
   deleted: (carry ball22 left)
   added: (at ball22 room3) (free left)
   goals met: 23 of 25
47. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 23 of 25
48. (pick ball2 rooma left)
   deleted: (at ball2 rooma) (free left)
   added: (carry ball2 left)
   goals met: 23 of 25
49. (pick ball1 rooma right)
   deleted: (at ball1 rooma) (free right)
   added: (carry ball1 right)
   goals met: 23 of 25
50. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 23 of 25
51. (drop ball2 room3 left)
   deleted: (carry ball2 left)
   added: (at ball2 room3) (free left)
   goals met: 24 of 25
52. (drop ball1 room3 right)
   deleted: (carry ball1 right)
   added: (at ball1 room3) (free right)
   goals met: 25 of 25
